First deal with the imports. Import pandas and numpy. Use the shortcut/alias names to be easier, and these are universally written this way.

In [1]:
import pandas as pd
import numpy as np

Below, we are importing a list of integers. In this case, it might be grades for a test. Here we use the Pandas library (pd) to create a Pandas object called a _series_.

In [2]:
series_a = pd.Series([90,85,88,86,91,79,82,65,88,87,96])

If you are familiar with tabular data (CSV, Excel, Google Sheets, etc.) a series is similar to a single column. Similar in that it has a single column of values, but automatically assigns an index to the values as well. This is SUPER important - Pandas LOVES indices.

In [3]:
series_a

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
8     88
9     87
10    96
dtype: int64

Pandas provides some methods to series. Here we can easily calculate the mean and median.

In [4]:
print series_a.mean()
print series_a.median()

85.1818181818
87.0

You can even drop duplicate values. If you are curious about what is available to you, press `tab` after the series name and see the methods available. This is the .drop_duplicates() method. It will drop any entries whose values have already been represented above it. Notice that the second 88 is dropped?

In [5]:
series_a.drop_duplicates()

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
9     87
10    96
dtype: int64

For the most part, unless you say specifically, the functions are not destructive. Even though we dropped the duplicates, they're still in there when we call the Series.

In [6]:
series_a

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
8     88
9     87
10    96
dtype: int64

Let's assign some usernames. First establish a list. Then, like before, we pass that list to Pandas and create a Series:

In [7]:
student_names = pd.Series(['WHARTNE','PTROUGH','JPERTWE','TBAKER','PDAVISO','CBAKER',
                 'SMCCOY','PMCGANN','CECCLES','DTENNAN','MSMITH','PCAPALD'])

Also, like before, Pandas has assigned an index to our list.

In [8]:
student_names

0     WHARTNE
1     PTROUGH
2     JPERTWE
3      TBAKER
4     PDAVISO
5      CBAKER
6      SMCCOY
7     PMCGANN
8     CECCLES
9     DTENNAN
10     MSMITH
11    PCAPALD
dtype: object

By using dictionaries (another python object) we can concatenate two series together on a specific axis, and name the columns at the same time. Below, we are creating an object called a DataFrame from two Series. Simply put, a DataFrame is a Series of one or more Series. In this case, we are aligning them as columns vertically, so we are saying axis = 1.

In [9]:
grades = pd.concat({'Names':student_names,'Midterm':series_a},axis=1)
grades

    Midterm    Names
0      90.0  WHARTNE
1      85.0  PTROUGH
2      88.0  JPERTWE
3      86.0   TBAKER
4      91.0  PDAVISO
5      79.0   CBAKER
6      82.0   SMCCOY
7      65.0  PMCGANN
8      88.0  CECCLES
9      87.0  DTENNAN
10     96.0   MSMITH
11      NaN  PCAPALD

When concatenating Series into a DataFrame, Pandas will do its best to align them by the index. In this case, however, we have more names than grades. Pandas and NumPy know this, and added a 'NaN' where data was missing. 'NaN' is NumPy's way of saying there is **N**ot **a** **N**umber here, and should be recognized as being invalid.

To correct this cell, it should be a simple matter of providing the coordinates of the cell, and assigning the value.

..._well, it should be easy..._

In [10]:
grades[1,11] = 85
grades

    Midterm    Names  (1, 11)
0      90.0  WHARTNE       85
1      85.0  PTROUGH       85
2      88.0  JPERTWE       85
3      86.0   TBAKER       85
4      91.0  PDAVISO       85
5      79.0   CBAKER       85
6      82.0   SMCCOY       85
7      65.0  PMCGANN       85
8      88.0  CECCLES       85
9      87.0  DTENNAN       85
10     96.0   MSMITH       85
11      NaN  PCAPALD       85

Since we did not format the cell coordinates correctly, Pandas assumed that we were creating a new column and setting its values to the grade specified. That obviously didn't work, so let's delete it using the drop method. Be sure to specify the axis, in case you have a row named the same as one of your columns (hey, it's possible). Also, let's reassign the edited DataFrame back to itself. Otherwise, the drop function just returns a **view** of the grades DataFrame with the column dropped, without actually dropping it.

In [11]:
grades = grades.drop((1,11),axis=1)

In [12]:
grades

    Midterm    Names
0      90.0  WHARTNE
1      85.0  PTROUGH
2      88.0  JPERTWE
3      86.0   TBAKER
4      91.0  PDAVISO
5      79.0   CBAKER
6      82.0   SMCCOY
7      65.0  PMCGANN
8      88.0  CECCLES
9      87.0  DTENNAN
10     96.0   MSMITH
11      NaN  PCAPALD

Now, let's look at ways to index into a Series and DataFrame. There are three indexing methods:
- .ix[]
- .loc[]
- .iloc[]

The first, .ix[] is the most friendly. It will first attempt to look up what you provide as a string, and if it can't find the string, look up based upon integer.

In [13]:
grades.ix[7,'Midterm']

65.0

We have used the .ix[] and supplied the row with the index 7, and the column 'Midterm'. For now, something like this is as simple as we need to be. We will DEFINITELY be coming back to this...

In the meantime, let's fill that space with a grade using '=', the assignment operator.

In [14]:
grades.ix[11,'Midterm'] = 85

Checking the DataFrame, we can see that the grade is in the right place.

In [15]:
grades

    Midterm    Names
0      90.0  WHARTNE
1      85.0  PTROUGH
2      88.0  JPERTWE
3      86.0   TBAKER
4      91.0  PDAVISO
5      79.0   CBAKER
6      82.0   SMCCOY
7      65.0  PMCGANN
8      88.0  CECCLES
9      87.0  DTENNAN
10     96.0   MSMITH
11     85.0  PCAPALD

We can also check the datatypes of the variables thus far:

In [16]:
type(series_a)

pandas.core.series.Series

In [17]:
type(grades)

pandas.core.frame.DataFrame

The .info() method provides a little more detail about the object. In this case, we'll look at the grades DataFrame.

In [18]:
grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
Midterm    12 non-null float64
Names      12 non-null object
dtypes: float64(1), object(1)
memory usage: 264.0+ bytes

We can see information about the column heads.

In [19]:
grades.columns

Index([u'Midterm', u'Names'], dtype='object')

Here is some statistical information about the numerical column(s).

In [20]:
grades.describe()

         Midterm
count  12.000000
mean   85.166667
std     7.685090
min    65.000000
25%    84.250000
50%    86.500000
75%    88.500000
max    96.000000

Masking
--
Masking is a way of hiding (or showing) cells based upon a Series/DataFrame of boolean (True/False) values. It is a very powerful way to do queries, provided you are willing to do a little work on the front end.

Perhaps, we want to see every row where the 'Midterm' is greater than 85.

In [21]:
grade_threshold = 85
grades['Midterm'] > grade_threshold

0      True
1     False
2      True
3      True
4      True
5     False
6     False
7     False
8      True
9      True
10     True
11    False
Name: Midterm, dtype: bool

We can also assign this list of boolean values to a variable, and use it as a mask.

In [22]:
b_threshold = grades['Midterm'] > grade_threshold
grades[b_threshold]

    Midterm    Names
0      90.0  WHARTNE
2      88.0  JPERTWE
3      86.0   TBAKER
4      91.0  PDAVISO
8      88.0  CECCLES
9      87.0  DTENNAN
10     96.0   MSMITH

Let's add some more grades into this class. We'll use the NumPy random integer method...

In [23]:
np.random.randint(69,high=100,size=12)

array([77, 72, 82, 86, 99, 70, 78, 84, 89, 72, 75, 98])

...and assign it to the final variable. Don't worry if your numbers look different. Each time this page is re-run, the random number generator will create a new list. In fact, this second execution is different from the first. See?

In [24]:
final = pd.Series(np.random.randint(69,high=100,size=12))

In [25]:
final

0     77
1     81
2     90
3     91
4     99
5     84
6     87
7     74
8     78
9     94
10    73
11    92
dtype: int32

Now, let's use the .concat() method to concatenate the grades DataFrame with the final Series on axis 1. We'll go ahead and explicitly name the columns as well.

In [26]:
grades_final = pd.concat([grades,final],axis=1)
grades_final.columns = ['Midterm','Names','Final']

In [27]:
grades_final

    Midterm    Names  Final
0      90.0  WHARTNE     77
1      85.0  PTROUGH     81
2      88.0  JPERTWE     90
3      86.0   TBAKER     91
4      91.0  PDAVISO     99
5      79.0   CBAKER     84
6      82.0   SMCCOY     87
7      65.0  PMCGANN     74
8      88.0  CECCLES     78
9      87.0  DTENNAN     94
10     96.0   MSMITH     73
11     85.0  PCAPALD     92

The index on the left doesn't make much sense in the context of the grades, so let's make the index equal to the names, and reassign to the grades_final DataFrame.

In [28]:
grades_final = grades_final.set_index('Names')

In [29]:
grades_final

         Midterm  Final
Names
WHARTNE     90.0     77
PTROUGH     85.0     81
JPERTWE     88.0     90
TBAKER      86.0     91
PDAVISO     91.0     99
CBAKER      79.0     84
SMCCOY      82.0     87
PMCGANN     65.0     74
CECCLES     88.0     78
DTENNAN     87.0     94
MSMITH      96.0     73
PCAPALD     85.0     92

Now, let's add another column to the DataFrame, averaging the values in each row.

In [30]:
grades_final['Avg.'] = grades_final.mean(axis=1)
grades_final

         Midterm  Final  Avg.
Names
WHARTNE     90.0     77  83.5
PTROUGH     85.0     81  83.0
JPERTWE     88.0     90  89.0
TBAKER      86.0     91  88.5
PDAVISO     91.0     99  95.0
CBAKER      79.0     84  81.5
SMCCOY      82.0     87  84.5
PMCGANN     65.0     74  69.5
CECCLES     88.0     78  83.0
DTENNAN     87.0     94  90.5
MSMITH      96.0     73  84.5
PCAPALD     85.0     92  88.5

Now, let's make a mask **in place**, getting every average greater than some grade.

In [31]:
grades_final[grades_final['Avg.']>85]

         Midterm  Final  Avg.
Names
JPERTWE     88.0     90  89.0
TBAKER      86.0     91  88.5
PDAVISO     91.0     99  95.0
DTENNAN     87.0     94  90.5
PCAPALD     85.0     92  88.5

We're not limited to built-in functions for extra cells, we can even make a weighted average for the two grades:

In [37]:
grades_final['W.Avg.'] = (grades_final['Midterm'] *.4 + grades_final['Final'] *.6)
grades_final

         Midterm  Final  Avg.  W.Avg.
Names
WHARTNE     90.0     77  83.5    82.2
PTROUGH     85.0     81  83.0    82.6
JPERTWE     88.0     90  89.0    89.2
TBAKER      86.0     91  88.5    89.0
PDAVISO     91.0     99  95.0    95.8
CBAKER      79.0     84  81.5    82.0
SMCCOY      82.0     87  84.5    85.0
PMCGANN     65.0     74  69.5    70.4
CECCLES     88.0     78  83.0    82.0
DTENNAN     87.0     94  90.5    91.2
MSMITH      96.0     73  84.5    82.2
PCAPALD     85.0     92  88.5    89.2